robinhedwards/UnoCart-2600/source/STM32firmware/Atari2600Cart/src/main.c
							result = soundAmplitudes[i];
						}
						break;
					}

					case 0x01:
					{	// DFx display data read
						result = DpcDisplayPtr[2047 - DpcCounters[index]];
						break;
					}

					case 0x02:
					{	// DFx display data read AND'd w/flag
						result = DpcDisplayPtr[2047 - DpcCounters[index]] & DpcFlags[index];
						break;
					}

					case 0x07:
					{	// DFx flag
						result = DpcFlags[index];
						break;
					}
				}

				DATA_OUT = ((uint16_t)result)<<8;
				SET_DATA_MODE_OUT
				// wait for address bus to change
				while (ADDR_IN == addr) ;
				SET_DATA_MODE_IN

				// Clock the selected data fetcher's counter if needed
				if ((index < 5) || ((index >= 5) && (!DpcMusicModes[index - 5])))
					DpcCounters[index] = (DpcCounters[index] - 1) & 0x07ff;
			}
			else if (addr < 0x1080)
			{	// DPC write
				int index = addr & 0x07;
				int function = (addr >> 3) & 0x07;

				while (ADDR_IN == addr) { data_prev = data; data = DATA_IN; }
				unsigned char value = data_prev>>8;
				switch (function)
				{
					case 0x00:
					{	// DFx top count
						DpcTops[index] = value;
						DpcFlags[index] = 0x00;
						break;
					}

					case 0x01:
					{	// DFx bottom count
						DpcBottoms[index] = value;
						break;
					}

					case 0x02:
					{	// DFx counter low
						DpcCounters[index] = (DpcCounters[index] & 0x0700) | value;
						break;
					}

					case 0x03:
					{	// DFx counter high
						DpcCounters[index] = (((uint16_t)(value & 0x07)) << 8) | (DpcCounters[index] & 0xff);
						if(index >= 5)
							DpcMusicModes[index - 5] = (value & 0x10);
						break;
					}

					case 0x06:
					{	// Random Number Generator Reset
						DpcRandom = 1;
						break;
					}
				}
			}
			else
			{	// check bank-switch
				if (addr == 0x1FF8)
					bankPtr = &cart_rom[0];
				else if (addr == 0x1FF9)
					bankPtr = &cart_rom[4*1024];

				// normal rom access
				DATA_OUT = ((uint16_t)bankPtr[addr&0xFFF])<<8;
				SET_DATA_MODE_OUT
				// wait for address bus to change
				while (ADDR_IN == addr) ;
				SET_DATA_MODE_IN
			}
		}
		else
		{	// non cartridge access - e.g. sta wsync
			while (ADDR_IN == addr) {
				// should the DPC clock be incremented?
				uint32_t sysTick = SysTick->VAL;
				if (sysTick > lastSysTick)
				{	// the 21KHz clock has wrapped, so we increase the DPC clock
					DpcClocks++;
					// update the music flags here, since there isn't enough time when the music register
					// is being read.
					DpcMusicFlags[0] = (DpcClocks % (DpcTops[5]+1)) > DpcBottoms[5];
					DpcMusicFlags[1] = (DpcClocks % (DpcTops[6]+1)) > DpcBottoms[6];
					DpcMusicFlags[2] = (DpcClocks % (DpcTops[7]+1)) > DpcBottoms[7];
				}
				lastSysTick = sysTick;
			}
		}
	}
	__enable_irq();
}

/*************************************************************************
 * Main loop/helper functions
 *************************************************************************/

void emulate_cartridge(int cart_type)
{
	if (cart_type == CART_TYPE_2K)
		emulate_2k_cartridge();
	else if (cart_type == CART_TYPE_4K)
		emulate_4k_cartridge();
	else if (cart_type == CART_TYPE_F8)
		emulate_FxSC_cartridge(0x1FF8, 0x1FF9, 0);
	else if (cart_type == CART_TYPE_F6)
		emulate_FxSC_cartridge(0x1FF6, 0x1FF9, 0);
	else if (cart_type == CART_TYPE_F4)
		emulate_FxSC_cartridge(0x1FF4, 0x1FFB, 0);
	else if (cart_type == CART_TYPE_F8SC)
		emulate_FxSC_cartridge(0x1FF8, 0x1FF9, 1);
	else if (cart_type == CART_TYPE_F6SC)
		emulate_FxSC_cartridge(0x1FF6, 0x1FF9, 1);
	else if (cart_type == CART_TYPE_F4SC)
		emulate_FxSC_cartridge(0x1FF4, 0x1FFB, 1);
	else if (cart_type == CART_TYPE_FE)
		emulate_FE_cartridge();
	else if (cart_type == CART_TYPE_3F)
		emulate_3F_cartridge();
	else if (cart_type == CART_TYPE_3E)
		emulate_3E_cartridge();
	else if (cart_type == CART_TYPE_E0)
		emulate_E0_cartridge();
	else if (cart_type == CART_TYPE_0840)
		emulate_0840_cartridge();
	else if (cart_type == CART_TYPE_CV)
		emulate_CV_cartridge();
	else if (cart_type == CART_TYPE_EF)
		emulate_FxSC_cartridge(0x1FE0, 0x1FEF, 0);
	else if (cart_type == CART_TYPE_EFSC)
		emulate_FxSC_cartridge(0x1FE0, 0x1FEF, 1);
	else if (cart_type == CART_TYPE_F0)
		emulate_F0_cartridge();
	else if (cart_type == CART_TYPE_FA)
		emulate_FA_cartridge();
	else if (cart_type == CART_TYPE_E7)
		emulate_E7_cartridge();
	else if (cart_type == CART_TYPE_DPC)
		emulate_DPC_cartridge();
	else if (cart_type == CART_TYPE_AR) {
		emulate_supercharger_cartridge(cartridge_image_path, cart_size_bytes);
	}
}

void convertFilenameForCart(unsigned char *dst, char *src)
{
	memset(dst, ' ', 12);
	for (int i=0; i<12; i++) {
		if (!src[i]) break;
		char c = toupper(src[i]);
		dst[i] = c;
	}
}

int readDirectoryForAtari(char *path)
{
	int ret = read_directory(path);
	uint8_t *menu_ram = get_menu_ram();
	// create a table of entries for the atari to read
	memset(menu_ram, 0, 1024);
	for (int i=0; i<num_dir_entries; i++)
	{
		unsigned char *dst = menu_ram + i*12;
		convertFilenameForCart(dst, dir_entries[i].long_filename);
		// set the high-bit of the first character if directory
		if (dir_entries[i].isDir) *dst += 0x80;
	}
	return ret;
}
int main(void)
{
	char curPath[256] = "";
	int cart_type = CART_TYPE_NONE;
	init();
	/* In/Out: PE{8..15} */
	config_gpio_data();
	/* In: PD{0..15} */
	config_gpio_addr();
	/* In: Other Cart Input Signals - PC{0..1} */
	config_gpio_sig();

	if (!(GPIOC->IDR & 0x0001))
		set_tv_mode(TV_MODE_PAL60);
	else if (!(GPIOC->IDR & 0x0002))
		set_tv_mode(TV_MODE_PAL);
	else
		set_tv_mode(TV_MODE_PAL60);

	// set up status area
	set_menu_status_msg("BY R.EDWARDS");
	set_menu_status_byte(0);

	while (1) {
		int ret = emulate_firmware_cartridge();

		if (ret == CART_CMD_ROOT_DIR)
		{
			curPath[0] = 0;
			if (!readDirectoryForAtari(curPath))
				set_menu_status_msg("CANT READ SD");
		}
		else
		{
			int sel = ret - CART_CMD_SEL_ITEM_n;
			DIR_ENTRY *d = &dir_entries[sel];

			if (d->isDir)
			{	// selection is a directory
				if (!strcmp(d->filename, ".."))
				{	// go back
					int len = strlen(curPath);
					while (len && curPath[--len] != '/');
					curPath[len] = 0;
				}
				else
				{	// go into director
					strcat(curPath, "/");
					strcat(curPath, d->filename);
				}

				if (!readDirectoryForAtari(curPath))
					set_menu_status_msg("CANT READ SD");
				Delayms(200);
			}
			else
			{	// selection is a rom file
				strcpy(cartridge_image_path, curPath);
				strcat(cartridge_image_path, "/");
				strcat(cartridge_image_path, d->filename);
				cart_type = identify_cartridge(cartridge_image_path);
				Delayms(200);
				if (cart_type != CART_TYPE_NONE)
					emulate_cartridge(cart_type);
				else
					set_menu_status_msg("BAD ROM FILE");
			}
		}
	}
}
